packages/server/guides/artillery/on_demand_subscriptions.yaml
config:
  target: ws://127.0.0.1:3000
  phases:
    - duration: 300
      arrivalRate: 10
      name: run
  ws:
    subprotocols:
      - json
scenarios:
  - engine: ws
    name: create a subscription
    flow:
      - connect: "{{ target }}/ws/subs"
      - send: > 
          { "origin": "urn:ocn:polkadot:2004", "senders": "*", "destinations": [ "urn:ocn:polkadot:0", "urn:ocn:polkadot:1000", "urn:ocn:polkadot:2000", "urn:ocn:polkadot:2034", "urn:ocn:polkadot:2104" ] }
      - think: 600